In [1]:
people = {
    "first" : ["Jacob","Jane","John"],
    "last" : ["Xi","Doe","Wick"],
    "email" : ["jacobxi@outlook.com","JaneDone@outlook.com", "JohnWick@outlook.com"]
}

In [2]:
import pandas as pd

In [3]:
df = pd.DataFrame(people)

In [4]:
df

   first  last                 email
0  Jacob    Xi   jacobxi@outlook.com
1   Jane   Doe  JaneDone@outlook.com
2   John  Wick  JohnWick@outlook.com

In [22]:
df.columns = ['first_name','last_name','email']

In [23]:
df

  first_name last_name                 email
0      Jacob        Xi   jacobxi@outlook.com
1       Jane       Doe  JaneDone@outlook.com
2       John      Wick  JohnWick@outlook.com

In [24]:
df.columns = [x.upper() for x in df.columns]

In [25]:
df

  FIRST_NAME LAST_NAME                 EMAIL
0      Jacob        Xi   jacobxi@outlook.com
1       Jane       Doe  JaneDone@outlook.com
2       John      Wick  JohnWick@outlook.com

In [26]:
df.columns = df.columns.str.replace('_',' ')

In [27]:
df

  FIRST NAME LAST NAME                 EMAIL
0      Jacob        Xi   jacobxi@outlook.com
1       Jane       Doe  JaneDone@outlook.com
2       John      Wick  JohnWick@outlook.com

In [28]:
df.columns = df.columns.str.replace(' ','_')

In [29]:
df

  FIRST_NAME LAST_NAME                 EMAIL
0      Jacob        Xi   jacobxi@outlook.com
1       Jane       Doe  JaneDone@outlook.com
2       John      Wick  JohnWick@outlook.com

In [30]:
df.columns = [x.lower() for x in df.columns]

In [32]:
df.rename(columns={'first_name':'first', 'last_name':'last'},inplace=True)

In [33]:
df

   first  last                 email
0  Jacob    Xi   jacobxi@outlook.com
1   Jane   Doe  JaneDone@outlook.com
2   John  Wick  JohnWick@outlook.com

In [34]:
df.loc[2] = ['John','Smith','JohnSmith@email.com']
df

   first   last                 email
0  Jacob     Xi   jacobxi@outlook.com
1   Jane    Doe  JaneDone@outlook.com
2   John  Smith   JohnSmith@email.com

In [36]:
df.loc[2,['last','email']] = ['Wick','JohnWick@email.com']

In [37]:
df

   first  last                 email
0  Jacob    Xi   jacobxi@outlook.com
1   Jane   Doe  JaneDone@outlook.com
2   John  Wick    JohnWick@email.com

In [38]:
df.loc[2,'last']='Smith'

In [39]:
df

   first   last                 email
0  Jacob     Xi   jacobxi@outlook.com
1   Jane    Doe  JaneDone@outlook.com
2   John  Smith    JohnWick@email.com

In [40]:
df.at[2,'last']='Wick'
df

   first  last                 email
0  Jacob    Xi   jacobxi@outlook.com
1   Jane   Doe  JaneDone@outlook.com
2   John  Wick    JohnWick@email.com

In [44]:
filt = (df['email'] == 'JohnWick@email.com')
df[filt]['last'] = 'Smith'

/usr/local/lib/python3.7/site-packages/ipykernel_launcher.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

In [45]:
df

   first  last                 email
0  Jacob    Xi   jacobxi@outlook.com
1   Jane   Doe  JaneDone@outlook.com
2   John  Wick    JohnWick@email.com

In [46]:
filt = (df['email'] == 'JohnWick@email.com')
df.loc[filt,'last'] = 'Smith'

In [47]:
df

   first   last                 email
0  Jacob     Xi   jacobxi@outlook.com
1   Jane    Doe  JaneDone@outlook.com
2   John  Smith    JohnWick@email.com

In [48]:
df['email'].str.lower()

0     jacobxi@outlook.com
1    janedone@outlook.com
2      johnwick@email.com
Name: email, dtype: object

In [49]:
df['email'] = df['email'].str.lower()
df

   first   last                 email
0  Jacob     Xi   jacobxi@outlook.com
1   Jane    Doe  janedone@outlook.com
2   John  Smith    johnwick@email.com

In [50]:
df['email'].apply(len)

0    19
1    20
2    18
Name: email, dtype: int64

In [51]:
def update_email(email):
    return email.upper()

In [52]:
df['email'] = df['email'].apply(update_email)

In [53]:
df

   first   last                 email
0  Jacob     Xi   JACOBXI@OUTLOOK.COM
1   Jane    Doe  JANEDONE@OUTLOOK.COM
2   John  Smith    JOHNWICK@EMAIL.COM

In [54]:
df['email'] = df['email'].apply(lambda x: x.lower())

In [55]:
df

   first   last                 email
0  Jacob     Xi   jacobxi@outlook.com
1   Jane    Doe  janedone@outlook.com
2   John  Smith    johnwick@email.com

In [57]:
df.apply(len, axis='columns')

0    3
1    3
2    3
dtype: int64

In [58]:
df.apply(pd.Series.min)

first                  Jacob
last                     Doe
email    jacobxi@outlook.com
dtype: object

In [60]:
df.apply(lambda x:x.min())

first                  Jacob
last                     Doe
email    jacobxi@outlook.com
dtype: object

In [62]:
df.applymap(len)

   first  last  email
0      5     2     19
1      4     3     20
2      4     5     18

In [ ]:
df['first'].replace({})